// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// 2020-11-11
// 18:31:14
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#include   "App.h"

/*-----------------------------------------------------------------------------------------------------
  Измеряем длительность интервала времени ti заданного в милисекундах
-----------------------------------------------------------------------------------------------------*/
uint64_t Measure_reference_time_interval(uint32_t time_delay_ms)
{
  ULONG   tickt1;
  ULONG   tickt2;
  uint64_t diff;

  tickt1 = tx_time_get();
  DELAY_ms(time_delay_ms);
  tickt2 = tx_time_get();

  diff = ((tickt2 - tickt1)*1000000ull)/(TX_TIMER_TICKS_PER_SECOND);
  return diff;
}


/*-----------------------------------------------------------------------------------------------------
  Получить значение с плавающей точкой по его адресу с защитой от конфликтов доступа в вытесняющей RTOS

  \param p_val

  \return float
-----------------------------------------------------------------------------------------------------*/
float   Get_float_val(volatile float *p_val)
{
  TX_INTERRUPT_SAVE_AREA;
  float v;
  TX_DISABLE;
  v = *p_val;
  TX_RESTORE;
  return v;
}

/*-----------------------------------------------------------------------------------------------------
  Записать значение с плавающей точкой по его адресу с защитой от конфликтов доступа в вытесняющей RTOS

  \param p_val
  \param val
-----------------------------------------------------------------------------------------------------*/
void Set_float_val(volatile float *p_val, float val)
{
  TX_INTERRUPT_SAVE_AREA;
  TX_DISABLE;
  *p_val = val;
  TX_RESTORE;
}

/*------------------------------------------------------------------------------
 Сброс системы
 ------------------------------------------------------------------------------*/
void Reset_system(void)
{
  __disable_interrupt();
  // System Control Block -> Application Interrupt and Reset Control Register
  *(uint32_t *)(0xE000ED0C)= 0x05FA0000 // Обязательный шаблон при записи в  регистр SCB_AIRCR
                            | BIT(2);  // Установка бита SYSRESETREQ
  for (;;)
  {
    __no_operation();
  }
}
